app/Http/Controllers/Admin/ReturnItem/ReturnItemController.php

select * from `loan_items` where `loan_items`.`loan_id` in (8)
select * from `loans` where `status` = 'approved' and not exists (select * from `return_items` where `loans`.`id` = `return_items`.`loan_id`) order by `created_at` desc
select * from `users` where `users`.`id` in (5)
select * from `loan_items` where `loan_items`.`loan_id` in (3)
select * from `loans` where `status` = 'returned' and exists (select * from `return_items` where `loans`.`id` = `return_items`.`loan_id`) order by `created_at` desc
select * from `return_items` where `return_items`.`loan_id` in (3)
select * from `users` where `users`.`id` in (4)
---
    public function index()
    {
        $waitingLoans = Loan::with(['user', 'loanItems.item'])
            ->where('status', 'request return')
            ->whereDoesntHave('returnItems')
            ->latest()
            ->get();
<<<<<<< HEAD

        $returnedLoans = Loan::with(['user', 'loanItems.item', 'returnItems'])
            ->whereIn('status', ['returned', 'late'])
            ->whereHas('returnItems')
            ->latest()
            ->get();

select * from `loan_items` where `loan_items`.`loan_id` in (8)
select * from `loans` where `loans`.`id` = '8' limit 1
---
    public function create($loanId)
    {
        $loan = Loan::with('loanItems.item')->findOrFail($loanId);

select * from `loans` where `loans`.`id` = '8' limit 1
select * from `loan_items` where `loan_items`.`loan_id` in (8)
insert into `return_items` (`loan_id`, `item_id`, `return_date`, `conditional`, `penalty`, `note`, `updated_at`, `created_at`) values (8, 19, '2025-06-09', 'good', 0, null, '2025-06-08 14:25:35', '2025-06-08 14:25:35')
---
    public function store(Request $request, $loanId)
    {
        $loan = Loan::with('loanItems')->findOrFail($loanId);
<<<<<<< HEAD
        $returnDate = \Carbon\Carbon::parse($request->return_date);
        $expectedReturnDate = \Carbon\Carbon::parse($loan->loan_date);

        $isLate = $returnDate->gt($expectedReturnDate);
=======
        $returnDate = \Carbon\Carbon::parse($request->return_date); // dari form input
        $expectedReturnDate = \Carbon\Carbon::parse($loan->loan_date); // batas waktu pengembalian

        $isLate = $returnDate->gt($expectedReturnDate); // cek keterlambatan
>>>>>>> 849fdb129e32cd7abf224ac2c7e71678ceb5156a

        foreach ($request->items as $itemId => $data) {
            $loanItem = $loan->loanItems->firstWhere('item_id', $itemId);
            $qty = $loanItem->quantity ?? 0;

            ReturnItem::create([
                'loan_id' => $loan->id,
                'item_id' => $itemId,
                'return_date' => $request->return_date,
                'conditional' => $data['conditional'],
                'penalty' => $data['penalty'] ?? 0,
                'note' => $data['note'] ?? null,
            ]);