app/Http/Controllers/Student/Dashboard/DashboardController.php

select count(*) as aggregate from `loans` where `user_id` = 5
select count(*) as aggregate from `loans` where `user_id` = 5 and `status` = 'approved'
select * from `loan_items` where `loan_items`.`loan_id` in (9, 10)
select * from `loans` where `user_id` = 5
select * from `return_items` where exists (select * from `loans` where `return_items`.`loan_id` = `loans`.`id` and `user_id` = 5) order by `return_date` desc limit 5
select * from `loans` where `user_id` = 5 order by `created_at` desc limit 5
---
    public function index()
{
    $user = Auth::user();

    $totalLoans = Loan::where('user_id', $user->id)->count();
    $activeLoans = Loan::where('user_id', $user->id)->where('status', 'approved')->count();
    $totalItemsBorrowed = Loan::where('user_id', $user->id)->with('loanItems')->get()->sum(function ($loan) {
        return $loan->loanItems->sum('quantity');
    });
    $returnedItems = ReturnItem::with(['item', 'loan'])
    ->whereHas('loan', fn ($q) => $q->where('user_id', $user->id))
    ->latest('return_date')
    ->take(5)
    ->get();

    $recentLoans = Loan::with('loanItems')
        ->where('user_id', $user->id)
        ->latest()
        ->take(5)
        ->get();