app/Livewire/Items.php

select * from `items` order by `created_at` desc
---
    public function render()
    {
        $items = Item::query()
            ->orderBy('created_at', 'desc')
            ->when($this->search, function ($query) {
                $query->where('name', 'like', '%' . $this->search . '%');
            })
            ->get();