app/Livewire/Loans.php

    public function mount()
    {
        $this->updateReturnedStatus();

        $this->loans = Loan::with(['user', 'loanItems.item'])->latest()->get();
---
select * from `loan_items` where `loan_items`.`loan_id` in (3, 4)
select * from `loans` order by `created_at` desc
select * from `users` where `users`.`id` in (4)

    public function approve($loanId)
    {
        $loan = Loan::with('loanItems.item')->findOrFail($loanId);
---
select * from `loan_items` where `loan_items`.`loan_id` in (4)
select * from `loans` where `loans`.`id` = 4 limit 1

    public function reject($loanId)
    {
        $loan = Loan::with('loanItems.item')->findOrFail($loanId);

        if ($loan->status !== 'pending') {
            flash()->error('Peminjaman sudah diproses sebelumnya.');
            return redirect()->back();
        }

        foreach ($loan->loanItems as $loanItem) {
            $item = $loanItem->item;
            $item->quantity += $loanItem->quantity;
            $item->save();
        }

        $loan->status = 'rejected';
        $loan->save();
---
select * from `loan_items` where `loan_items`.`loan_id` in (11)
select * from `loans` where `loans`.`id` = 11 limit 1
update `loans` set `status` = 'approved', `loans`.`updated_at` = '2025-06-08 08:50:10' where `id` = 4
update `items` set `quantity` = 2, `items`.`updated_at` = '2025-06-09 00:14:37' where `id` = 19
update `loans` set `status` = 'rejected', `loans`.`updated_at` = '2025-06-09 00:14:37' where `id` = 11

    protected function updateReturnedStatus()
    {
        $approvedLoans = Loan::with(['returnItems'])
            ->where('status', 'approved')
            ->get();
---
select * from `loans` where `status` = 'approved'
select * from `return_items` where `return_items`.`loan_id` in (13)