app/Http/Controllers/AdminController.php

select count(*) as aggregate from `loans`
select count(*) as aggregate from `loans` where `status` = 'request return'
select count(*) as aggregate from `items`
select * from `loan_items` where `loan_items`.`loan_id` in (3, 9, 10)
select * from `loans` order by `created_at` desc limit 5
select * from `users` where `users`.`id` in (4, 5)
select * from `loans` where `status` = 'approved' and date(`loan_date`) < '2025-06-08' and not exists (select * from `return_items` where `loans`.`id` = `return_items`.`loan_id`)
select `users`.*, (select count(*) from `loans` where `users`.`id` = `loans`.`user_id`) as `loans_count` from `users` order by `loans_count` desc limit 5
select count(*) as aggregate from `loans` where date(`loan_date`) = '2025-06-02'
select `name`, SUM(loan_items.quantity) as total_borrowed from `items` inner join `loan_items` on `items`.`id` = `loan_items`.`item_id` group by `items`.`id`, `items`.`name` order by `total_borrowed` desc limit 5
---
    public function index()
    {
        $totalLoans = Loan::count();
        $pendingReturns = Loan::where('status', 'request return')->count();
        $totalItems = Item::count();
        $recentLoans = Loan::with('user', 'loanItems')->latest()->take(5)->get();
        $lateLoans = Loan::where('status', 'approved')
            ->whereDate('loan_date', '<', now()->toDateString())
            ->doesntHave('returnItems')
            ->with('user')
            ->get();

            $topUsers = User::withCount('loans')
            ->orderByDesc('loans_count')
            ->take(5)
            ->get()
            ->map(function ($user) {
                return (object)[
                    'name' => $user->name,
                    'total_loans' => $user->loans_count,
                ];
            });

        $topItems = Item::select('name', DB::raw('SUM(loan_items.quantity) as total_borrowed'))
            ->join('loan_items', 'items.id', '=', 'loan_items.item_id')
            ->groupBy('items.id', 'items.name')
            ->orderByDesc('total_borrowed')
            ->take(5)
            ->get();

select count(*) as aggregate from `loans` where date(`loan_date`) = '2025-06-02'
---
            $date = Carbon::now()->subDays($i)->toDateString();
            $label = Carbon::parse($date)->format('d M');

            $loanCount = Loan::whereDate('loan_date', $date)->count();