app/Http/Controllers/Student/Loan/LoanController.php

    public function index(Request $request)
    {
        $search = $request->input('search');

        $loans = Loan::with('user')
            ->where('user_id', Auth::id())
            ->when($search, function ($query, $search) {
                $query->whereHas('user', function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%");
                });
            })
            ->orderBy('loan_date', 'desc')
            ->paginate(5);
---
select * from `loans` where `user_id` = 6 order by `loan_date` desc
select * from `users` where `users`.`id` in (6)

    public function create()
    {
        $user = auth()->user();

        $pendingLoansCount = $user->loans()->where('status', 'pending')->count();

        if ($pendingLoansCount >= 2) {
            flash()->addError('Kamu tidak bisa mengajukan peminjaman baru! karena masih memiliki 2 peminjaman dengan status masih pending.');
            return redirect()->route('loans.index');
        }

        $items = Item::where('quantity', '>', 0)->get();
---
select count(*) as aggregate from `loans` where `loans`.`user_id` = 6 and `loans`.`user_id` is not null and `status` = 'pending'
select * from `items` where `quantity` > 0

    public function edit(Loan $loan)
    {
        abort_unless($loan->user_id === auth()->id() && $loan->status === 'pending', 403);

        $items = Item::all();
---
select * from `items`

    public function update(Request $request, Loan $loan)
    {
        // Hanya bisa diakses oleh user dan statusnya pending
        abort_unless($loan->user_id === auth()->id() && $loan->status === 'pending', 403);

        // Validasi data
        $validator = Validator::make($request->all(), [
            'loan_date' => 'required|date',
            'start_at' => 'required|date_format:H:i',
            'return_at' => 'required|date_format:H:i|after:start_at',
            'items' => 'required|array',
            'items.*.selected' => 'sometimes|accepted',
            'items.*.quantity' => 'nullable|integer|min:1|max:2',
            'items.*.notes' => 'nullable|string|max:255',
        ]);
---
select * from `items` where `quantity` > 0