app/Http/Controllers/Student/Loan/LoanController.php

    public function create()
    {
        $items = Item::all();
---
select * from `items`